# Дано двузначное число. Определить: входит ли в него цифра 5.
# Попробуйте решить её с использованием целочисленного деления и деления с остатком.

x = str(input("Введите двухзначное число:"))

print('5' in x)
